  ### Deployment Results ✅

  **jcetina** successfully deployed branch `jcetina/more-sites/build` to **production**

  <details><summary>Show Results</summary>

  ```terraform
[command]/home/runner/work/_temp/aab7536d-65da-41f2-ac85-f574678364d2/terraform-bin apply -no-color -auto-approve -compact-warnings

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

# module.eastus2-vms[0].azurerm_network_interface.nic has been deleted
- resource "azurerm_network_interface" "nic" {
    - id                            = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/networkInterfaces/eastus2-vm-0-nic" -> null
      name                          = "eastus2-vm-0-nic"
      tags                          = {}
      # (11 unchanged attributes hidden)

      # (1 unchanged block hidden)
  }

# module.eastus2-vms[0].azurerm_network_security_group.nsg has been deleted
- resource "azurerm_network_security_group" "nsg" {
    - id                  = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/networkSecurityGroups/eastus2-vm-0-nsg" -> null
      name                = "eastus2-vm-0-nsg"
      tags                = {}
      # (3 unchanged attributes hidden)
  }

# module.eastus2-vms[0].azurerm_public_ip.public_ip[0] has been deleted
- resource "azurerm_public_ip" "public_ip" {
    - id                      = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/publicIPAddresses/eastus2-vm-0-public-ip" -> null
      name                    = "eastus2-vm-0-public-ip"
      # (9 unchanged attributes hidden)
  }

# module.eastus2-vms[0].azurerm_storage_account.storage has been deleted
- resource "azurerm_storage_account" "storage" {
      id                                = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Storage/storageAccounts/diag5d0412a820a54eb5"
      name                              = "diag5d0412a820a54eb5"
    - primary_blob_endpoint             = "https://diag5d0412a820a54eb5.blob.core.windows.net/" -> null
      tags                              = {}
      # (33 unchanged attributes hidden)

      # (4 unchanged blocks hidden)
  }

# module.sites["eastus2"].azurerm_public_ip.gateway has been deleted
- resource "azurerm_public_ip" "gateway" {
    - id                      = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/publicIPAddresses/azure-eastus2-vgw-pip" -> null
      name                    = "azure-eastus2-vgw-pip"
      tags                    = {}
      # (10 unchanged attributes hidden)
  }

# module.sites["eastus2"].azurerm_subnet.gateway has been deleted
- resource "azurerm_subnet" "gateway" {
    - id                                             = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/virtualNetworks/azure-eastus2/subnets/GatewaySubnet" -> null
      name                                           = "GatewaySubnet"
      # (7 unchanged attributes hidden)
  }

# module.sites["eastus2"].azurerm_subnet.vm has been deleted
- resource "azurerm_subnet" "vm" {
    - id                                             = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/virtualNetworks/azure-eastus2/subnets/VmSubnet" -> null
      name                                           = "VmSubnet"
      # (7 unchanged attributes hidden)
  }

# module.sites["eastus2"].azurerm_virtual_network.vnet has been deleted
- resource "azurerm_virtual_network" "vnet" {
      id                      = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/virtualNetworks/azure-eastus2"
    - name                    = "azure-eastus2" -> null
      tags                    = {}
      # (7 unchanged attributes hidden)
  }

# module.sites["eastus2"].azurerm_virtual_network_gateway.gateway has been deleted
- resource "azurerm_virtual_network_gateway" "gateway" {
    - id                         = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/virtualNetworkGateways/azure-eastus2-vgw" -> null
      name                       = "azure-eastus2-vgw"
      tags                       = {}
      # (9 unchanged attributes hidden)

      # (2 unchanged blocks hidden)
  }

# module.sites["westus2"].azurerm_public_ip.gateway has been deleted
- resource "azurerm_public_ip" "gateway" {
    - id                      = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/publicIPAddresses/azure-westus2-vgw-pip" -> null
      name                    = "azure-westus2-vgw-pip"
      tags                    = {}
      # (10 unchanged attributes hidden)
  }

# module.sites["westus2"].azurerm_subnet.gateway has been deleted
- resource "azurerm_subnet" "gateway" {
    - id                                             = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/virtualNetworks/azure-westus2/subnets/GatewaySubnet" -> null
      name                                           = "GatewaySubnet"
      # (7 unchanged attributes hidden)
  }

# module.sites["westus2"].azurerm_subnet.vm has been deleted
- resource "azurerm_subnet" "vm" {
    - id                                             = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/virtualNetworks/azure-westus2/subnets/VmSubnet" -> null
      name                                           = "VmSubnet"
      # (7 unchanged attributes hidden)
  }

# module.sites["westus2"].azurerm_virtual_network.vnet has been deleted
- resource "azurerm_virtual_network" "vnet" {
      id                      = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/virtualNetworks/azure-westus2"
    - name                    = "azure-westus2" -> null
      tags                    = {}
      # (7 unchanged attributes hidden)
  }

# module.sites["westus2"].azurerm_virtual_network_gateway.gateway has been deleted
- resource "azurerm_virtual_network_gateway" "gateway" {
    - id                         = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/virtualNetworkGateways/azure-westus2-vgw" -> null
      name                       = "azure-westus2-vgw"
      tags                       = {}
      # (9 unchanged attributes hidden)

      # (2 unchanged blocks hidden)
  }

# module.westus2-vms[0].azurerm_network_interface.nic has been deleted
- resource "azurerm_network_interface" "nic" {
    - id                            = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/networkInterfaces/westus2-vm-0-nic" -> null
      name                          = "westus2-vm-0-nic"
      tags                          = {}
      # (11 unchanged attributes hidden)

      # (1 unchanged block hidden)
  }

# module.westus2-vms[0].azurerm_network_security_group.nsg has been deleted
- resource "azurerm_network_security_group" "nsg" {
    - id                  = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/networkSecurityGroups/westus2-vm-0-nsg" -> null
      name                = "westus2-vm-0-nsg"
      tags                = {}
      # (3 unchanged attributes hidden)
  }

# module.westus2-vms[0].azurerm_public_ip.public_ip[0] has been deleted
- resource "azurerm_public_ip" "public_ip" {
    - id                      = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/publicIPAddresses/westus2-vm-0-public-ip" -> null
      name                    = "westus2-vm-0-public-ip"
      # (9 unchanged attributes hidden)
  }

# module.westus2-vms[0].azurerm_storage_account.storage has been deleted
- resource "azurerm_storage_account" "storage" {
      id                                = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Storage/storageAccounts/diag568ee10db602c5c2"
      name                              = "diag568ee10db602c5c2"
    - primary_blob_endpoint             = "https://diag568ee10db602c5c2.blob.core.windows.net/" -> null
      tags                              = {}
      # (33 unchanged attributes hidden)

      # (4 unchanged blocks hidden)
  }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

# azurerm_virtual_network_gateway_connection.east_west will be created
+ resource "azurerm_virtual_network_gateway_connection" "east_west" {
    + connection_mode                    = "Default"
    + connection_protocol                = (known after apply)
    + enable_bgp                         = (known after apply)
    + express_route_gateway_bypass       = (known after apply)
    + id                                 = (known after apply)
    + location                           = "eastus2"
    + name                               = "east-west-connection"
    + peer_virtual_network_gateway_id    = (known after apply)
    + resource_group_name                = "org-jcetina-repo-baklava-rg"
    + routing_weight                     = (known after apply)
    + shared_key                         = (sensitive value)
    + type                               = "Vnet2Vnet"
    + use_policy_based_traffic_selectors = (known after apply)
    + virtual_network_gateway_id         = (known after apply)
  }

# azurerm_virtual_network_gateway_connection.west_east will be created
+ resource "azurerm_virtual_network_gateway_connection" "west_east" {
    + connection_mode                    = "Default"
    + connection_protocol                = (known after apply)
    + enable_bgp                         = (known after apply)
    + express_route_gateway_bypass       = (known after apply)
    + id                                 = (known after apply)
    + location                           = "westus2"
    + name                               = "west-east-connection"
    + peer_virtual_network_gateway_id    = (known after apply)
    + resource_group_name                = "org-jcetina-repo-baklava-rg"
    + routing_weight                     = (known after apply)
    + shared_key                         = (sensitive value)
    + type                               = "Vnet2Vnet"
    + use_policy_based_traffic_selectors = (known after apply)
    + virtual_network_gateway_id         = (known after apply)
  }

# module.eastus2-vms[0].azurerm_linux_virtual_machine.vm will be created
+ resource "azurerm_linux_virtual_machine" "vm" {
    + admin_username                  = "adminuser"
    + allow_extension_operations      = true
    + computer_name                   = (known after apply)
    + disable_password_authentication = true
    + extensions_time_budget          = "PT1H30M"
    + id                              = (known after apply)
    + location                        = "eastus2"
    + max_bid_price                   = -1
    + name                            = "eastus2-vm-0"
    + network_interface_ids           = (known after apply)
    + patch_mode                      = "ImageDefault"
    + platform_fault_domain           = -1
    + priority                        = "Regular"
    + private_ip_address              = (known after apply)
    + private_ip_addresses            = (known after apply)
    + provision_vm_agent              = true
    + public_ip_address               = (known after apply)
    + public_ip_addresses             = (known after apply)
    + resource_group_name             = "org-jcetina-repo-baklava-rg"
    + size                            = "Standard_F2"
    + virtual_machine_id              = (known after apply)

    + admin_ssh_key {
        + public_key = <<-EOT
              ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDXfeNESzeBpNFl0W8801NXA+539N6Q06VPKFV63alXC77aoNgNBNU16jDajStBz7zA6brxhwhwTR9V4zQwLJxLkmq2oO8mm1zqy1AgeWC2/zwvp7PJ1Md7vNbmERInJ6FN8C6Xa7jf3NbFQfnaodnb9j+zuFKN4HGi0+Su/EUzvMAqeMS1RjFTxQGhpG0zRdHL9sqnKKR2c9S3/XSWNFej3XFueuMhUnGqyv84vVZYx6SpH383wFIa7Y1p+Skkf3o9WQsQ6pdGvcTIDx6V4+vo5lKUmMOHLiJNx3fGjoDHIDbnhT1GH2Hb8IjFkUKfRqCLr1zKxiWoMxmb/Ipx0FnF jcetina@Jasons-MBP
          EOT
        + username   = "adminuser"
      }

    + boot_diagnostics {
        + storage_account_uri = (known after apply)
      }

    + os_disk {
        + caching                   = "ReadWrite"
        + disk_size_gb              = (known after apply)
        + name                      = (known after apply)
        + storage_account_type      = "Standard_LRS"
        + write_accelerator_enabled = false
      }

    + source_image_reference {
        + offer     = "0001-com-ubuntu-server-focal"
        + publisher = "Canonical"
        + sku       = "20_04-lts"
        + version   = "latest"
      }

    + termination_notification {
        + enabled = (known after apply)
        + timeout = (known after apply)
      }
  }

# module.eastus2-vms[0].azurerm_network_interface.nic will be created
+ resource "azurerm_network_interface" "nic" {
    + applied_dns_servers           = (known after apply)
    + dns_servers                   = (known after apply)
    + enable_accelerated_networking = false
    + enable_ip_forwarding          = false
    + id                            = (known after apply)
    + internal_dns_name_label       = (known after apply)
    + internal_domain_name_suffix   = (known after apply)
    + location                      = "eastus2"
    + mac_address                   = (known after apply)
    + name                          = "eastus2-vm-0-nic"
    + private_ip_address            = (known after apply)
    + private_ip_addresses          = (known after apply)
    + resource_group_name           = "org-jcetina-repo-baklava-rg"
    + virtual_machine_id            = (known after apply)

    + ip_configuration {
        + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
        + name                                               = "internal"
        + primary                                            = (known after apply)
        + private_ip_address                                 = (known after apply)
        + private_ip_address_allocation                      = "Dynamic"
        + private_ip_address_version                         = "IPv4"
        + public_ip_address_id                               = (known after apply)
        + subnet_id                                          = (known after apply)
      }
  }

# module.eastus2-vms[0].azurerm_network_interface_security_group_association.nsg_association will be created
+ resource "azurerm_network_interface_security_group_association" "nsg_association" {
    + id                        = (known after apply)
    + network_interface_id      = (known after apply)
    + network_security_group_id = (known after apply)
  }

# module.eastus2-vms[0].azurerm_network_security_group.nsg will be created
+ resource "azurerm_network_security_group" "nsg" {
    + id                  = (known after apply)
    + location            = "eastus2"
    + name                = "eastus2-vm-0-nsg"
    + resource_group_name = "org-jcetina-repo-baklava-rg"
    + security_rule       = [
        + {
            + access                                     = "Allow"
            + description                                = ""
            + destination_address_prefix                 = "*"
            + destination_address_prefixes               = []
            + destination_application_security_group_ids = []
            + destination_port_range                     = "22"
            + destination_port_ranges                    = []
            + direction                                  = "Inbound"
            + name                                       = "SSH"
            + priority                                   = 1001
            + protocol                                   = "Tcp"
            + source_address_prefix                      = "*"
            + source_address_prefixes                    = []
            + source_application_security_group_ids      = []
            + source_port_range                          = "*"
            + source_port_ranges                         = []
          },
      ]
  }

# module.eastus2-vms[0].azurerm_public_ip.public_ip[0] will be created
+ resource "azurerm_public_ip" "public_ip" {
    + allocation_method       = "Static"
    + fqdn                    = (known after apply)
    + id                      = (known after apply)
    + idle_timeout_in_minutes = 4
    + ip_address              = (known after apply)
    + ip_version              = "IPv4"
    + location                = "eastus2"
    + name                    = "eastus2-vm-0-public-ip"
    + resource_group_name     = "org-jcetina-repo-baklava-rg"
    + sku                     = "Standard"
    + sku_tier                = "Regional"
    + zones                   = [
        + "1",
        + "2",
        + "3",
      ]
  }

# module.eastus2-vms[0].azurerm_storage_account.storage will be created
+ resource "azurerm_storage_account" "storage" {
    + access_tier                       = (known after apply)
    + account_kind                      = "StorageV2"
    + account_replication_type          = "LRS"
    + account_tier                      = "Standard"
    + allow_nested_items_to_be_public   = true
    + cross_tenant_replication_enabled  = true
    + enable_https_traffic_only         = true
    + id                                = (known after apply)
    + infrastructure_encryption_enabled = false
    + is_hns_enabled                    = false
    + large_file_share_enabled          = (known after apply)
    + location                          = "eastus2"
    + min_tls_version                   = "TLS1_2"
    + name                              = "diag5d0412a820a54eb5"
    + nfsv3_enabled                     = false
    + primary_access_key                = (sensitive value)
    + primary_blob_connection_string    = (sensitive value)
    + primary_blob_endpoint             = (known after apply)
    + primary_blob_host                 = (known after apply)
    + primary_connection_string         = (sensitive value)
    + primary_dfs_endpoint              = (known after apply)
    + primary_dfs_host                  = (known after apply)
    + primary_file_endpoint             = (known after apply)
    + primary_file_host                 = (known after apply)
    + primary_location                  = (known after apply)
    + primary_queue_endpoint            = (known after apply)
    + primary_queue_host                = (known after apply)
    + primary_table_endpoint            = (known after apply)
    + primary_table_host                = (known after apply)
    + primary_web_endpoint              = (known after apply)
    + primary_web_host                  = (known after apply)
    + queue_encryption_key_type         = "Service"
    + resource_group_name               = "org-jcetina-repo-baklava-rg"
    + secondary_access_key              = (sensitive value)
    + secondary_blob_connection_string  = (sensitive value)
    + secondary_blob_endpoint           = (known after apply)
    + secondary_blob_host               = (known after apply)
    + secondary_connection_string       = (sensitive value)
    + secondary_dfs_endpoint            = (known after apply)
    + secondary_dfs_host                = (known after apply)
    + secondary_file_endpoint           = (known after apply)
    + secondary_file_host               = (known after apply)
    + secondary_location                = (known after apply)
    + secondary_queue_endpoint          = (known after apply)
    + secondary_queue_host              = (known after apply)
    + secondary_table_endpoint          = (known after apply)
    + secondary_table_host              = (known after apply)
    + secondary_web_endpoint            = (known after apply)
    + secondary_web_host                = (known after apply)
    + shared_access_key_enabled         = true
    + table_encryption_key_type         = "Service"

    + blob_properties {
        + change_feed_enabled      = (known after apply)
        + default_service_version  = (known after apply)
        + last_access_time_enabled = (known after apply)
        + versioning_enabled       = (known after apply)

        + container_delete_retention_policy {
            + days = (known after apply)
          }

        + cors_rule {
            + allowed_headers    = (known after apply)
            + allowed_methods    = (known after apply)
            + allowed_origins    = (known after apply)
            + exposed_headers    = (known after apply)
            + max_age_in_seconds = (known after apply)
          }

        + delete_retention_policy {
            + days = (known after apply)
          }
      }

    + network_rules {
        + bypass                     = (known after apply)
        + default_action             = (known after apply)
        + ip_rules                   = (known after apply)
        + virtual_network_subnet_ids = (known after apply)

        + private_link_access {
            + endpoint_resource_id = (known after apply)
            + endpoint_tenant_id   = (known after apply)
          }
      }

    + queue_properties {
        + cors_rule {
            + allowed_headers    = (known after apply)
            + allowed_methods    = (known after apply)
            + allowed_origins    = (known after apply)
            + exposed_headers    = (known after apply)
            + max_age_in_seconds = (known after apply)
          }

        + hour_metrics {
            + enabled               = (known after apply)
            + include_apis          = (known after apply)
            + retention_policy_days = (known after apply)
            + version               = (known after apply)
          }

        + logging {
            + delete                = (known after apply)
            + read                  = (known after apply)
            + retention_policy_days = (known after apply)
            + version               = (known after apply)
            + write                 = (known after apply)
          }

        + minute_metrics {
            + enabled               = (known after apply)
            + include_apis          = (known after apply)
            + retention_policy_days = (known after apply)
            + version               = (known after apply)
          }
      }

    + routing {
        + choice                      = (known after apply)
        + publish_internet_endpoints  = (known after apply)
        + publish_microsoft_endpoints = (known after apply)
      }

    + share_properties {
        + cors_rule {
            + allowed_headers    = (known after apply)
            + allowed_methods    = (known after apply)
            + allowed_origins    = (known after apply)
            + exposed_headers    = (known after apply)
            + max_age_in_seconds = (known after apply)
          }

        + retention_policy {
            + days = (known after apply)
          }

        + smb {
            + authentication_types            = (known after apply)
            + channel_encryption_type         = (known after apply)
            + kerberos_ticket_encryption_type = (known after apply)
            + versions                        = (known after apply)
          }
      }
  }

# module.sites["eastus2"].azurerm_public_ip.gateway will be created
+ resource "azurerm_public_ip" "gateway" {
    + allocation_method       = "Static"
    + fqdn                    = (known after apply)
    + id                      = (known after apply)
    + idle_timeout_in_minutes = 15
    + ip_address              = (known after apply)
    + ip_version              = "IPv4"
    + location                = "eastus2"
    + name                    = "azure-eastus2-vgw-pip"
    + resource_group_name     = "org-jcetina-repo-baklava-rg"
    + sku                     = "Standard"
    + sku_tier                = "Regional"
    + zones                   = [
        + "1",
        + "2",
        + "3",
      ]
  }

# module.sites["eastus2"].azurerm_subnet.gateway will be created
+ resource "azurerm_subnet" "gateway" {
    + address_prefixes                               = [
        + "10.0.0.0/27",
      ]
    + enforce_private_link_endpoint_network_policies = false
    + enforce_private_link_service_network_policies  = false
    + id                                             = (known after apply)
    + name                                           = "GatewaySubnet"
    + resource_group_name                            = "org-jcetina-repo-baklava-rg"
    + virtual_network_name                           = "azure-eastus2"
  }

# module.sites["eastus2"].azurerm_subnet.vm will be created
+ resource "azurerm_subnet" "vm" {
    + address_prefixes                               = [
        + "10.0.1.0/24",
      ]
    + enforce_private_link_endpoint_network_policies = false
    + enforce_private_link_service_network_policies  = false
    + id                                             = (known after apply)
    + name                                           = "VmSubnet"
    + resource_group_name                            = "org-jcetina-repo-baklava-rg"
    + virtual_network_name                           = "azure-eastus2"
  }

# module.sites["eastus2"].azurerm_virtual_network.vnet will be created
+ resource "azurerm_virtual_network" "vnet" {
    + address_space       = [
        + "10.0.0.0/16",
      ]
    + dns_servers         = (known after apply)
    + guid                = (known after apply)
    + id                  = (known after apply)
    + location            = "eastus2"
    + name                = "azure-eastus2"
    + resource_group_name = "org-jcetina-repo-baklava-rg"
    + subnet              = (known after apply)
  }

# module.sites["eastus2"].azurerm_virtual_network_gateway.gateway will be created
+ resource "azurerm_virtual_network_gateway" "gateway" {
    + active_active       = (known after apply)
    + enable_bgp          = false
    + generation          = (known after apply)
    + id                  = (known after apply)
    + location            = "eastus2"
    + name                = "azure-eastus2-vgw"
    + resource_group_name = "org-jcetina-repo-baklava-rg"
    + sku                 = "VpnGw2AZ"
    + type                = "Vpn"
    + vpn_type            = "RouteBased"

    + bgp_settings {
        + asn         = (known after apply)
        + peer_weight = (known after apply)

        + peering_addresses {
            + apipa_addresses       = (known after apply)
            + default_addresses     = (known after apply)
            + ip_configuration_name = (known after apply)
            + tunnel_ip_addresses   = (known after apply)
          }
      }

    + ip_configuration {
        + name                          = "vnetGatewayConfig"
        + private_ip_address_allocation = "Dynamic"
        + public_ip_address_id          = (known after apply)
        + subnet_id                     = (known after apply)
      }
  }

# module.sites["westus2"].azurerm_public_ip.gateway will be created
+ resource "azurerm_public_ip" "gateway" {
    + allocation_method       = "Static"
    + fqdn                    = (known after apply)
    + id                      = (known after apply)
    + idle_timeout_in_minutes = 15
    + ip_address              = (known after apply)
    + ip_version              = "IPv4"
    + location                = "westus2"
    + name                    = "azure-westus2-vgw-pip"
    + resource_group_name     = "org-jcetina-repo-baklava-rg"
    + sku                     = "Standard"
    + sku_tier                = "Regional"
    + zones                   = [
        + "1",
        + "2",
        + "3",
      ]
  }

# module.sites["westus2"].azurerm_subnet.gateway will be created
+ resource "azurerm_subnet" "gateway" {
    + address_prefixes                               = [
        + "10.1.0.0/27",
      ]
    + enforce_private_link_endpoint_network_policies = false
    + enforce_private_link_service_network_policies  = false
    + id                                             = (known after apply)
    + name                                           = "GatewaySubnet"
    + resource_group_name                            = "org-jcetina-repo-baklava-rg"
    + virtual_network_name                           = "azure-westus2"
  }

# module.sites["westus2"].azurerm_subnet.vm will be created
+ resource "azurerm_subnet" "vm" {
    + address_prefixes                               = [
        + "10.1.1.0/24",
      ]
    + enforce_private_link_endpoint_network_policies = false
    + enforce_private_link_service_network_policies  = false
    + id                                             = (known after apply)
    + name                                           = "VmSubnet"
    + resource_group_name                            = "org-jcetina-repo-baklava-rg"
    + virtual_network_name                           = "azure-westus2"
  }

# module.sites["westus2"].azurerm_virtual_network.vnet will be created
+ resource "azurerm_virtual_network" "vnet" {
    + address_space       = [
        + "10.1.0.0/16",
      ]
    + dns_servers         = (known after apply)
    + guid                = (known after apply)
    + id                  = (known after apply)
    + location            = "westus2"
    + name                = "azure-westus2"
    + resource_group_name = "org-jcetina-repo-baklava-rg"
    + subnet              = (known after apply)
  }

# module.sites["westus2"].azurerm_virtual_network_gateway.gateway will be created
+ resource "azurerm_virtual_network_gateway" "gateway" {
    + active_active       = (known after apply)
    + enable_bgp          = false
    + generation          = (known after apply)
    + id                  = (known after apply)
    + location            = "westus2"
    + name                = "azure-westus2-vgw"
    + resource_group_name = "org-jcetina-repo-baklava-rg"
    + sku                 = "VpnGw2AZ"
    + type                = "Vpn"
    + vpn_type            = "RouteBased"

    + bgp_settings {
        + asn         = (known after apply)
        + peer_weight = (known after apply)

        + peering_addresses {
            + apipa_addresses       = (known after apply)
            + default_addresses     = (known after apply)
            + ip_configuration_name = (known after apply)
            + tunnel_ip_addresses   = (known after apply)
          }
      }

    + ip_configuration {
        + name                          = "vnetGatewayConfig"
        + private_ip_address_allocation = "Dynamic"
        + public_ip_address_id          = (known after apply)
        + subnet_id                     = (known after apply)
      }
  }

# module.westus2-vms[0].azurerm_linux_virtual_machine.vm will be created
+ resource "azurerm_linux_virtual_machine" "vm" {
    + admin_username                  = "adminuser"
    + allow_extension_operations      = true
    + computer_name                   = (known after apply)
    + disable_password_authentication = true
    + extensions_time_budget          = "PT1H30M"
    + id                              = (known after apply)
    + location                        = "westus2"
    + max_bid_price                   = -1
    + name                            = "westus2-vm-0"
    + network_interface_ids           = (known after apply)
    + patch_mode                      = "ImageDefault"
    + platform_fault_domain           = -1
    + priority                        = "Regular"
    + private_ip_address              = (known after apply)
    + private_ip_addresses            = (known after apply)
    + provision_vm_agent              = true
    + public_ip_address               = (known after apply)
    + public_ip_addresses             = (known after apply)
    + resource_group_name             = "org-jcetina-repo-baklava-rg"
    + size                            = "Standard_F2"
    + virtual_machine_id              = (known after apply)

    + admin_ssh_key {
        + public_key = <<-EOT
              ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDXfeNESzeBpNFl0W8801NXA+539N6Q06VPKFV63alXC77aoNgNBNU16jDajStBz7zA6brxhwhwTR9V4zQwLJxLkmq2oO8mm1zqy1AgeWC2/zwvp7PJ1Md7vNbmERInJ6FN8C6Xa7jf3NbFQfnaodnb9j+zuFKN4HGi0+Su/EUzvMAqeMS1RjFTxQGhpG0zRdHL9sqnKKR2c9S3/XSWNFej3XFueuMhUnGqyv84vVZYx6SpH383wFIa7Y1p+Skkf3o9WQsQ6pdGvcTIDx6V4+vo5lKUmMOHLiJNx3fGjoDHIDbnhT1GH2Hb8IjFkUKfRqCLr1zKxiWoMxmb/Ipx0FnF jcetina@Jasons-MBP
          EOT
        + username   = "adminuser"
      }

    + boot_diagnostics {
        + storage_account_uri = (known after apply)
      }

    + os_disk {
        + caching                   = "ReadWrite"
        + disk_size_gb              = (known after apply)
        + name                      = (known after apply)
        + storage_account_type      = "Standard_LRS"
        + write_accelerator_enabled = false
      }

    + source_image_reference {
        + offer     = "0001-com-ubuntu-server-focal"
        + publisher = "Canonical"
        + sku       = "20_04-lts"
        + version   = "latest"
      }

    + termination_notification {
        + enabled = (known after apply)
        + timeout = (known after apply)
      }
  }

# module.westus2-vms[0].azurerm_network_interface.nic will be created
+ resource "azurerm_network_interface" "nic" {
    + applied_dns_servers           = (known after apply)
    + dns_servers                   = (known after apply)
    + enable_accelerated_networking = false
    + enable_ip_forwarding          = false
    + id                            = (known after apply)
    + internal_dns_name_label       = (known after apply)
    + internal_domain_name_suffix   = (known after apply)
    + location                      = "westus2"
    + mac_address                   = (known after apply)
    + name                          = "westus2-vm-0-nic"
    + private_ip_address            = (known after apply)
    + private_ip_addresses          = (known after apply)
    + resource_group_name           = "org-jcetina-repo-baklava-rg"
    + virtual_machine_id            = (known after apply)

    + ip_configuration {
        + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
        + name                                               = "internal"
        + primary                                            = (known after apply)
        + private_ip_address                                 = (known after apply)
        + private_ip_address_allocation                      = "Dynamic"
        + private_ip_address_version                         = "IPv4"
        + public_ip_address_id                               = (known after apply)
        + subnet_id                                          = (known after apply)
      }
  }

# module.westus2-vms[0].azurerm_network_interface_security_group_association.nsg_association will be created
+ resource "azurerm_network_interface_security_group_association" "nsg_association" {
    + id                        = (known after apply)
    + network_interface_id      = (known after apply)
    + network_security_group_id = (known after apply)
  }

# module.westus2-vms[0].azurerm_network_security_group.nsg will be created
+ resource "azurerm_network_security_group" "nsg" {
    + id                  = (known after apply)
    + location            = "westus2"
    + name                = "westus2-vm-0-nsg"
    + resource_group_name = "org-jcetina-repo-baklava-rg"
    + security_rule       = [
        + {
            + access                                     = "Allow"
            + description                                = ""
            + destination_address_prefix                 = "*"
            + destination_address_prefixes               = []
            + destination_application_security_group_ids = []
            + destination_port_range                     = "22"
            + destination_port_ranges                    = []
            + direction                                  = "Inbound"
            + name                                       = "SSH"
            + priority                                   = 1001
            + protocol                                   = "Tcp"
            + source_address_prefix                      = "*"
            + source_address_prefixes                    = []
            + source_application_security_group_ids      = []
            + source_port_range                          = "*"
            + source_port_ranges                         = []
          },
      ]
  }

# module.westus2-vms[0].azurerm_public_ip.public_ip[0] will be created
+ resource "azurerm_public_ip" "public_ip" {
    + allocation_method       = "Static"
    + fqdn                    = (known after apply)
    + id                      = (known after apply)
    + idle_timeout_in_minutes = 4
    + ip_address              = (known after apply)
    + ip_version              = "IPv4"
    + location                = "westus2"
    + name                    = "westus2-vm-0-public-ip"
    + resource_group_name     = "org-jcetina-repo-baklava-rg"
    + sku                     = "Standard"
    + sku_tier                = "Regional"
    + zones                   = [
        + "1",
        + "2",
        + "3",
      ]
  }

# module.westus2-vms[0].azurerm_storage_account.storage will be created
+ resource "azurerm_storage_account" "storage" {
    + access_tier                       = (known after apply)
    + account_kind                      = "StorageV2"
    + account_replication_type          = "LRS"
    + account_tier                      = "Standard"
    + allow_nested_items_to_be_public   = true
    + cross_tenant_replication_enabled  = true
    + enable_https_traffic_only         = true
    + id                                = (known after apply)
    + infrastructure_encryption_enabled = false
    + is_hns_enabled                    = false
    + large_file_share_enabled          = (known after apply)
    + location                          = "westus2"
    + min_tls_version                   = "TLS1_2"
    + name                              = "diag568ee10db602c5c2"
    + nfsv3_enabled                     = false
    + primary_access_key                = (sensitive value)
    + primary_blob_connection_string    = (sensitive value)
    + primary_blob_endpoint             = (known after apply)
    + primary_blob_host                 = (known after apply)
    + primary_connection_string         = (sensitive value)
    + primary_dfs_endpoint              = (known after apply)
    + primary_dfs_host                  = (known after apply)
    + primary_file_endpoint             = (known after apply)
    + primary_file_host                 = (known after apply)
    + primary_location                  = (known after apply)
    + primary_queue_endpoint            = (known after apply)
    + primary_queue_host                = (known after apply)
    + primary_table_endpoint            = (known after apply)
    + primary_table_host                = (known after apply)
    + primary_web_endpoint              = (known after apply)
    + primary_web_host                  = (known after apply)
    + queue_encryption_key_type         = "Service"
    + resource_group_name               = "org-jcetina-repo-baklava-rg"
    + secondary_access_key              = (sensitive value)
    + secondary_blob_connection_string  = (sensitive value)
    + secondary_blob_endpoint           = (known after apply)
    + secondary_blob_host               = (known after apply)
    + secondary_connection_string       = (sensitive value)
    + secondary_dfs_endpoint            = (known after apply)
    + secondary_dfs_host                = (known after apply)
    + secondary_file_endpoint           = (known after apply)
    + secondary_file_host               = (known after apply)
    + secondary_location                = (known after apply)
    + secondary_queue_endpoint          = (known after apply)
    + secondary_queue_host              = (known after apply)
    + secondary_table_endpoint          = (known after apply)
    + secondary_table_host              = (known after apply)
    + secondary_web_endpoint            = (known after apply)
    + secondary_web_host                = (known after apply)
    + shared_access_key_enabled         = true
    + table_encryption_key_type         = "Service"

    + blob_properties {
        + change_feed_enabled      = (known after apply)
        + default_service_version  = (known after apply)
        + last_access_time_enabled = (known after apply)
        + versioning_enabled       = (known after apply)

        + container_delete_retention_policy {
            + days = (known after apply)
          }

        + cors_rule {
            + allowed_headers    = (known after apply)
            + allowed_methods    = (known after apply)
            + allowed_origins    = (known after apply)
            + exposed_headers    = (known after apply)
            + max_age_in_seconds = (known after apply)
          }

        + delete_retention_policy {
            + days = (known after apply)
          }
      }

    + network_rules {
        + bypass                     = (known after apply)
        + default_action             = (known after apply)
        + ip_rules                   = (known after apply)
        + virtual_network_subnet_ids = (known after apply)

        + private_link_access {
            + endpoint_resource_id = (known after apply)
            + endpoint_tenant_id   = (known after apply)
          }
      }

    + queue_properties {
        + cors_rule {
            + allowed_headers    = (known after apply)
            + allowed_methods    = (known after apply)
            + allowed_origins    = (known after apply)
            + exposed_headers    = (known after apply)
            + max_age_in_seconds = (known after apply)
          }

        + hour_metrics {
            + enabled               = (known after apply)
            + include_apis          = (known after apply)
            + retention_policy_days = (known after apply)
            + version               = (known after apply)
          }

        + logging {
            + delete                = (known after apply)
            + read                  = (known after apply)
            + retention_policy_days = (known after apply)
            + version               = (known after apply)
            + write                 = (known after apply)
          }

        + minute_metrics {
            + enabled               = (known after apply)
            + include_apis          = (known after apply)
            + retention_policy_days = (known after apply)
            + version               = (known after apply)
          }
      }

    + routing {
        + choice                      = (known after apply)
        + publish_internet_endpoints  = (known after apply)
        + publish_microsoft_endpoints = (known after apply)
      }

    + share_properties {
        + cors_rule {
            + allowed_headers    = (known after apply)
            + allowed_methods    = (known after apply)
            + allowed_origins    = (known after apply)
            + exposed_headers    = (known after apply)
            + max_age_in_seconds = (known after apply)
          }

        + retention_policy {
            + days = (known after apply)
          }

        + smb {
            + authentication_types            = (known after apply)
            + channel_encryption_type         = (known after apply)
            + kerberos_ticket_encryption_type = (known after apply)
            + versions                        = (known after apply)
          }
      }
  }

Plan: 24 to add, 0 to change, 0 to destroy.
module.eastus2-vms[0].azurerm_public_ip.public_ip[0]: Creating...
module.westus2-vms[0].azurerm_storage_account.storage: Creating...
module.sites["eastus2"].azurerm_virtual_network.vnet: Creating...
module.westus2-vms[0].azurerm_network_security_group.nsg: Creating...
module.westus2-vms[0].azurerm_public_ip.public_ip[0]: Creating...
module.eastus2-vms[0].azurerm_storage_account.storage: Creating...
module.eastus2-vms[0].azurerm_network_security_group.nsg: Creating...
module.sites["westus2"].azurerm_virtual_network.vnet: Creating...
module.eastus2-vms[0].azurerm_public_ip.public_ip[0]: Creation complete after 3s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/publicIPAddresses/eastus2-vm-0-public-ip]
module.westus2-vms[0].azurerm_public_ip.public_ip[0]: Creation complete after 3s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/publicIPAddresses/westus2-vm-0-public-ip]
module.eastus2-vms[0].azurerm_network_security_group.nsg: Creation complete after 4s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/networkSecurityGroups/eastus2-vm-0-nsg]
module.westus2-vms[0].azurerm_network_security_group.nsg: Creation complete after 5s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/networkSecurityGroups/westus2-vm-0-nsg]
module.sites["eastus2"].azurerm_virtual_network.vnet: Creation complete after 5s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/virtualNetworks/azure-eastus2]
module.sites["eastus2"].azurerm_subnet.vm: Creating...
module.sites["eastus2"].azurerm_subnet.gateway: Creating...
module.sites["eastus2"].azurerm_public_ip.gateway: Creating...
module.sites["westus2"].azurerm_virtual_network.vnet: Creation complete after 6s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/virtualNetworks/azure-westus2]
module.sites["westus2"].azurerm_subnet.vm: Creating...
module.sites["westus2"].azurerm_subnet.gateway: Creating...
module.sites["westus2"].azurerm_public_ip.gateway: Creating...
module.sites["eastus2"].azurerm_public_ip.gateway: Creation complete after 2s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/publicIPAddresses/azure-eastus2-vgw-pip]
module.sites["westus2"].azurerm_public_ip.gateway: Creation complete after 2s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/publicIPAddresses/azure-westus2-vgw-pip]
module.sites["eastus2"].azurerm_subnet.vm: Creation complete after 4s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/virtualNetworks/azure-eastus2/subnets/VmSubnet]
module.westus2-vms[0].azurerm_storage_account.storage: Still creating... [10s elapsed]
module.eastus2-vms[0].azurerm_storage_account.storage: Still creating... [10s elapsed]
module.sites["westus2"].azurerm_subnet.gateway: Creation complete after 5s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/virtualNetworks/azure-westus2/subnets/GatewaySubnet]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Creating...
module.sites["eastus2"].azurerm_subnet.gateway: Creation complete after 7s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/virtualNetworks/azure-eastus2/subnets/GatewaySubnet]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Creating...
module.sites["westus2"].azurerm_subnet.vm: Creation complete after 10s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/virtualNetworks/azure-westus2/subnets/VmSubnet]
module.westus2-vms[0].azurerm_network_interface.nic: Creating...
module.eastus2-vms[0].azurerm_network_interface.nic: Creating...
module.eastus2-vms[0].azurerm_network_interface.nic: Creation complete after 1s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/networkInterfaces/eastus2-vm-0-nic]
module.eastus2-vms[0].azurerm_network_interface_security_group_association.nsg_association: Creating...
module.eastus2-vms[0].azurerm_network_interface_security_group_association.nsg_association: Creation complete after 0s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/networkInterfaces/eastus2-vm-0-nic|/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/networkSecurityGroups/eastus2-vm-0-nsg]
module.westus2-vms[0].azurerm_network_interface.nic: Creation complete after 2s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/networkInterfaces/westus2-vm-0-nic]
module.westus2-vms[0].azurerm_network_interface_security_group_association.nsg_association: Creating...
module.westus2-vms[0].azurerm_network_interface_security_group_association.nsg_association: Creation complete after 1s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/networkInterfaces/westus2-vm-0-nic|/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/networkSecurityGroups/westus2-vm-0-nsg]
module.westus2-vms[0].azurerm_storage_account.storage: Still creating... [20s elapsed]
module.eastus2-vms[0].azurerm_storage_account.storage: Still creating... [20s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [10s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [10s elapsed]
module.eastus2-vms[0].azurerm_storage_account.storage: Creation complete after 24s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Storage/storageAccounts/diag5d0412a820a54eb5]
module.eastus2-vms[0].azurerm_linux_virtual_machine.vm: Creating...
module.westus2-vms[0].azurerm_storage_account.storage: Creation complete after 24s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Storage/storageAccounts/diag568ee10db602c5c2]
module.westus2-vms[0].azurerm_linux_virtual_machine.vm: Creating...
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [20s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [20s elapsed]
module.eastus2-vms[0].azurerm_linux_virtual_machine.vm: Still creating... [10s elapsed]
module.westus2-vms[0].azurerm_linux_virtual_machine.vm: Still creating... [10s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [30s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [30s elapsed]
module.eastus2-vms[0].azurerm_linux_virtual_machine.vm: Still creating... [20s elapsed]
module.westus2-vms[0].azurerm_linux_virtual_machine.vm: Still creating... [20s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [40s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [40s elapsed]
module.eastus2-vms[0].azurerm_linux_virtual_machine.vm: Still creating... [30s elapsed]
module.westus2-vms[0].azurerm_linux_virtual_machine.vm: Still creating... [30s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [50s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [50s elapsed]
module.eastus2-vms[0].azurerm_linux_virtual_machine.vm: Still creating... [40s elapsed]
module.westus2-vms[0].azurerm_linux_virtual_machine.vm: Still creating... [40s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [1m0s elapsed]
module.westus2-vms[0].azurerm_linux_virtual_machine.vm: Creation complete after 48s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Compute/virtualMachines/westus2-vm-0]
module.eastus2-vms[0].azurerm_linux_virtual_machine.vm: Creation complete after 48s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Compute/virtualMachines/eastus2-vm-0]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [1m0s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [1m10s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [1m10s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [1m20s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [1m20s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [1m30s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [1m30s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [1m40s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [1m40s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [1m50s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [1m50s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [2m0s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [2m0s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [2m10s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [2m10s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [2m20s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [2m20s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [2m30s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [2m30s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [2m40s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [2m40s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [2m50s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [2m50s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [3m0s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [3m0s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [3m10s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [3m10s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [3m20s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [3m20s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [3m30s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [3m30s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [3m40s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [3m40s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [3m50s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [3m50s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [4m0s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [4m0s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [4m10s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [4m10s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [4m20s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [4m20s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [4m30s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [4m30s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [4m40s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [4m40s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [4m50s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [4m50s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [5m0s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [5m0s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [5m10s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [5m10s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [5m20s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [5m20s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [5m30s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [5m31s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [5m40s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [5m41s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [5m50s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [5m51s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [6m0s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [6m1s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [6m10s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [6m11s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [6m20s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [6m21s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [6m30s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [6m31s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [6m40s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [6m41s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [6m50s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [6m51s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [7m0s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [7m1s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [7m10s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [7m11s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [7m20s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [7m21s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [7m30s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [7m31s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [7m40s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [7m41s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [7m50s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [7m51s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [8m0s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [8m1s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [8m10s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [8m11s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [8m20s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [8m21s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [8m30s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [8m31s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [8m40s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [8m41s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [8m50s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [8m51s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [9m0s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [9m1s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [9m10s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [9m11s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [9m20s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [9m21s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [9m30s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [9m31s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [9m40s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [9m41s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [9m50s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [9m51s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [10m0s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [10m1s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [10m10s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [10m11s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [10m20s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [10m21s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [10m30s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [10m31s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [10m40s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [10m41s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [10m50s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [10m51s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [11m0s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [11m1s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [11m10s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [11m11s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [11m20s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [11m21s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [11m30s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [11m31s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [11m40s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [11m41s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [11m50s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [11m51s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [12m0s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [12m1s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [12m10s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [12m11s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [12m20s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [12m21s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [12m30s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [12m31s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [12m40s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [12m41s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [12m50s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [12m51s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [13m0s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [13m1s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [13m10s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [13m11s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [13m20s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [13m21s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [13m30s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [13m31s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [13m40s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [13m41s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [13m50s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [13m51s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [14m0s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [14m1s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [14m10s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [14m11s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [14m20s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [14m21s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [14m30s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [14m31s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [14m40s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [14m41s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [14m50s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [14m51s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [15m0s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [15m1s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [15m10s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [15m11s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [15m20s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [15m21s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [15m30s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [15m31s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [15m40s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [15m41s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [15m50s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [15m51s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [16m0s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [16m1s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [16m10s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [16m11s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [16m20s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [16m21s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [16m30s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [16m31s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [16m40s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [16m41s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [16m50s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [16m51s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [17m0s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [17m1s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [17m10s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [17m11s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [17m20s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [17m21s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [17m30s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [17m31s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [17m40s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [17m41s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [17m50s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [17m51s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [18m0s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [18m1s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [18m10s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [18m11s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [18m20s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [18m21s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [18m30s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [18m31s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [18m40s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [18m41s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [18m50s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [18m51s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [19m0s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [19m1s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [19m10s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [19m11s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [19m20s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [19m21s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [19m30s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [19m31s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [19m40s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [19m41s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Creation complete after 19m44s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/virtualNetworkGateways/azure-westus2-vgw]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [19m51s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [20m1s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [20m11s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [20m21s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [20m31s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [20m41s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [20m51s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [21m1s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [21m11s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [21m21s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [21m31s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [21m41s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [21m51s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [22m1s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [22m11s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [22m21s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [22m31s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [22m41s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [22m51s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [23m1s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Creation complete after 23m4s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/virtualNetworkGateways/azure-eastus2-vgw]
azurerm_virtual_network_gateway_connection.west_east: Creating...
azurerm_virtual_network_gateway_connection.east_west: Creating...
azurerm_virtual_network_gateway_connection.east_west: Still creating... [10s elapsed]
azurerm_virtual_network_gateway_connection.west_east: Still creating... [10s elapsed]
azurerm_virtual_network_gateway_connection.east_west: Still creating... [20s elapsed]
azurerm_virtual_network_gateway_connection.west_east: Still creating... [20s elapsed]
azurerm_virtual_network_gateway_connection.west_east: Still creating... [30s elapsed]
azurerm_virtual_network_gateway_connection.east_west: Still creating... [30s elapsed]
azurerm_virtual_network_gateway_connection.west_east: Still creating... [40s elapsed]
azurerm_virtual_network_gateway_connection.east_west: Still creating... [40s elapsed]
azurerm_virtual_network_gateway_connection.east_west: Creation complete after 42s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/connections/east-west-connection]
azurerm_virtual_network_gateway_connection.west_east: Still creating... [50s elapsed]
azurerm_virtual_network_gateway_connection.west_east: Still creating... [1m0s elapsed]
azurerm_virtual_network_gateway_connection.west_east: Still creating... [1m10s elapsed]
azurerm_virtual_network_gateway_connection.west_east: Still creating... [1m20s elapsed]
azurerm_virtual_network_gateway_connection.west_east: Still creating... [1m30s elapsed]
azurerm_virtual_network_gateway_connection.west_east: Still creating... [1m40s elapsed]
azurerm_virtual_network_gateway_connection.west_east: Creation complete after 1m43s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/connections/west-east-connection]

Apply complete! Resources: 24 added, 0 changed, 0 destroyed.
```

  </details>